posts = [
    {"text": "Приглашаем специалистов в области машинного обучения и AI продемонстрировать свои навыки и знания на GoodForecast Hack, который пройдет с 20 по 22 октября!", 
"photo": "https://www.zavodit.ru/_next/image?url=%2Fupload%2Fmedia%2Fdefault%2F0001%2F01%2Fc6053900eff51ee946b14ae41ae8893083332743.png&w=828&q=25", 
"link": "https://хакатоны.рус/tpost/7dvp0pnfl1-goodsforecast-hack", 
"category": "Хакатоны", 
"tags": ["Data Science", "Machine Learning", "AI"]},

{"text": "С 27 по 29 октября 2023 года пройдет онлайн-марафон CheckAI Hack. CheckAI Hack - это уникальное соревнование, которое объединит молодых специалистов в поиске инновационных решений в области искусственного интеллекта.", 
"photo": "https://static.tildacdn.com/tild3633-6530-4935-b637-626365313566/CheckAI_HACK.png", 
"link": "https://хакатоны.рус/tpost/e76sex5gr1-checkai-hack", 
"category": "Хакатоны", 
"tags": ["AI", "Machine Learning", "Python"]},

{"text": "НИЯУ МИФИ и АНО «Корпоративная Академия Росатома» приглашают студентов и школьников со всей Москвы на Хакатон «Atomic Hack». Это соревнование для тех, кто готов бросить вызов научным и индустриальным задачам и заметно развить свои навыки.", 
"photo": "https://i.ytimg.com/vi/pqh82xQbs1k/maxresdefault.jpg", 
"link": "https://digital.mephi.ru/atomichack", 
"category": "Хакатоны", 
"tags": ["Frontend", "JavaScript"]},

{"text": "TulaHack2023 - это 40 часов упорной работы над IT-проектом, начиная с формирования команды и генерации идеи, и заканчивая презентацией прототипа (MVP) продукта перед экспертами.", 
"photo": "https://static.tildacdn.com/tild3231-3735-4333-b565-666231373766/tula_khak.png", 
"link": "https://хакатоны.рус/tpost/n4pm7c3ug1-tulanack-20-accelerator", 
"category": "Хакатоны", 
"tags": ["С#", "PHP"]},

{"text": "📣 Внимание, Backend-разработчики и разработчики мобильных приложений на Java! \n\nПрисоединяйтесь к IT_ONE CAREER MEETUP, который состоится 26 октября в 18:00. IT_One  – разработчик программного обеспечения для крупных игроков российского бизнеса и государственных органов. Компания реализует крупнейшие проекты цифровой трансформации страны. Спектр задач – от поддержки приложения до разработки концептуальной бизнес-архитектуры уровня корпорации.", 
"photo": "https://www.zavodit.ru/_next/image?url=%2Fupload%2Fmedia%2Fdefault%2F0001%2F01%2Fc6053900eff51ee946b14ae41ae8893083332743.png&w=828&q=25", 
"link": "https://www.zavodit.ru/ru/calendar/event/39", 
"category": "Хакатоны", 
"tags": ["Backend", "Java", "Android", "Mobile development", "SQL"]},

{"text": "Кубок CTF России - один из крупнейших турниров страны по информационной безопасности в формате CTF.\n\nСоревнование пройдет в несколько этапов, а победителем в этом году станет не одна, а целых три команды!\n\nКто может участвовать?\n- Учащиеся образовательных учреждений высшего и среднего профессионального образования, осуществляющих подготовку по направлению «Информационная безопасность» и смежным направлениям;\n- Учащиеся общеобразовательных организаций Российской Федерации;\n- Молодые профессионалы возрастом до 25 лет (включительно).\n\nМесто проведения: онлайн/офлайн в г. Москва 'Сколково'\n\nОтборочный этап: 28-29 октября (онлайн)", 
"photo": "https://static.tildacdn.com/tild3339-6130-4230-a136-623238316136/_CTF1.png", 
"link": "https://хакатоны.рус/tpost/i7eb49du21-vii-kubok-ctf-rossii-2023", 
"category": "Хакатоны", 
"tags": ["Cybersecurity"]},

{"text": '''Привет, студент! На связи Совкомбанк! 
 
Выпуск из вуза близок, а строчка об опыте работы все еще пустует? Сейчас самое время что-то предпринять 🚀 
 
Приглашаем тебя стать участником грандиозного кейс-чемпионата от Совкомбанка "Лига Приключений". 
 
⚡️Мероприятие пройдет в онлайне, лучших позовем на очный финал 27 октября в гостиницу Park Inn. 
 
На Лиге ты сможешь: 
- Решить реальную финтех задачу и применить свои знания на практике;; 
- Пообщаться с топовыми экспертами и руководителями банка; 
- Пойти на грандиозное After Party 28 октября; 
- Выиграть денежный приз 
- Получить оффер и устроиться на работу в Группу Совкомбанк. 
 
👉🏻Собирай команду от 2-5 человек и регистрируйся до 16 октября! Если команды ещё нет - мы поможем тебе её найти''', 
"photo": "https://hacklist.ru/wp-content/uploads/2023/10/photo_2023-09-28_07-46-47-1024x576.jpg", 
"link": "https://adventure-league-scb.ru/spb", 
"category": "Хакатоны", 
"tags": ["Web development", "Frontend"]},


{"text": ''' "Мой Бизнес" - национальный проект по поддержке малого и среднего бизнеса!

Только начинаете свое дело? С радостью ждем вас в нашем проекте! Мы покажем путь от идеи – к большому бизнесу 👍

📌Обратившись в центр «Мой бизнес», любой предприниматель или человек, планирующий открыть свое дело, может получить консультацию по всем интересующим вопросам, подать документы, а также получить весь спектр услуг и сервисов, связанных с началом и ведением бизнеса.

📚Кроме того, мы проводим семинары, Stand-up-лекции, форумы, ярмарки бизнес-идей, стажировки и конкурсы и многое другое для начинающих предпринимателей!

📝В простой и доступной форме БЕСПЛАТНО мы расскажем бизнесу о тех возможностях, которые разработаны государством для его комфортного существования и развития!''', 
"photo": "https://sun9-28.userapi.com/impg/E0rO4EeFpf88r3x2gnMuYT6n_LQyDzoHImHvDw/z8CnWce6qaA.jpg?size=1502x735&quality=95&sign=d5ebaffd06d11c31fcbddc4499d42d4c&type=album", 
"link": "https://vk.com/guap_job?w=wall-34879489_9521", 
"category": "Форумы", 
"tags": ["Business"]},


{"text": '''Разработка мобильных приложений на Java: Android-разработка с использованием Java". Вы узнаете: 

1. История Java в Android-разработке 

2. Про Java и 2017 год 
 
3. Какое место занимает Java в мобильной разработке под Android сегодня?''',     
"photo": "https://media.tproger.ru/uploads/2021/07/IMG_2087.jpg",     
"link": "https://itonecareer.ru/meetup_october",     
"category": "Форумы",     
"tags": ["Java ", "Android"]}
]